#include <stdio.h>

void main()
{
    //二维数组
    int a[4][6];

    int i, j;

    for (i = 0; i < 4; i++)
    {
        for (j = 0; j < 6; j++)
        {
            a[i][j] = 0;
        }
    }

    a[1][2] = 1;
    a[2][1] = 2;
    a[2][3] = 3; //输出二维数组
    for (i = 0; i < 4; i++)
    {
        for (j = 0; j < 6; j++)
        {
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }

    printf("\n 二维数组 a 的首地址=%p", a);
    printf("\n 二维数组 a[0]的地址=%p", a[0]);

    printf("\n 二维数组 a[0][0]的地址=%p", &a[0][0]);
    printf("\n 二维数组 a[0][1]的地址=%p", &a[0][1]); //将二维数组的各个元素得地址输出
    printf("\n");

    for (i = 0; i < 4; i++)
    {
        printf("a[%d]的地址=%p \n", i, a[i]);
        for (j = 0; j < 6; j++)
        {
            printf("a[%d][%d]的地址=%p\n", i, j, &a[i][j]);
        }
        printf("\n");
    }

    int b[4][6] = {
        {0,1,2,3,1,8},
        {0,8,10,4,0,0},
        {0,0,11,0,1,0},
        {0,0,10,12,11,0}
    };

    //自动匹配
    int c[4][6] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
     
    int d[4][6] = {{1}, {2}, {3},{1}};

    int rows = sizeof(b)/sizeof(b[0]);
    int cols = sizeof(b[0])/sizeof(int);


    for (i = 0; i < rows; i++)
    {
        for (j = 0; j < cols; j++)
        {
            printf("%d\t", b[i][j]);
        }
        
        printf("\n");
    }
    int e[][3] = {1, 2, 3, 4, 5, 6, 7, 8, 9};
    
}

// 说明
// 1.可以只对部分元素赋值，未赋值的元素自动取“零”值
// 2.如果对全部元素赋值，那么第一维的长度可以不给出。
// 3.二维数组可以看作是由一维数组嵌套而成的;如果一个数组的每个元素又是一个数组，那么它就是二维数组。
// 二维数组 a[3][4]可看成三个一维数组，它们的数组名分别为 a[0]、a[1]、a[2]。二维数组 a[3][4]可看成三个一维数组，它们的数组名分别为 a[0]、a[1]、a[2]。