#include <stdio.h>

void main() {
    //浮点型的分类
    //1.float单精度 4个字节存储 精度为6位小数 值范围 1.2E-38 到 3.4E+38
    //2.double双精度 8个字节存储 精度为15位小数 值范围 2.3E-308 到 1.7E+308

    float d1 = 1.1;
    float d2 = 1.1f; //强制使用float类型

    double d3 = 1.3;

    double d4 = 5.12;
    double d5 = .512;
    double d6 = 5.12e2; //5.12*(10^2)
    double d7 = 5.12e-2; //0.0512

    printf("d1=%f d2=%f d3=%f d4=%f d5=%f d6=%f d7=%f", d1, d2, d3, d4, d5, d6, d7);
}

// 说明
// 1.关于浮点数在机器中的存放形式说明 浮点数=符号位+指数位+尾数位（小数点后的）
// 2.尾数位可能会丢失 造成精度损失
// 3.浮点数都是近似值
// 4.浮点数常量默认是double类型 声明float型常量时 需在后加f或者F
// 5.浮点数常量的两种表示形式 十进制形式如 5.12 512.0f .512 (必须有小数点) 科学计数法 形式如 5.12e2 5.12E-2
// 6.通常情况下 应该使用double类型 因为比float更加精确 
// 7.printf("d1=%f", d1) 在输出时默认保留小数点6位